In [1]:
import pandas as pd

#series

In [2]:
s=pd.Series(12)
print(s)

0    12
dtype: int64

In [3]:
dict1={
    "name":["shrey","rohit","shubham","vivek"],
    "marks":[100,23,1,2],
    "city":["unnao","ahmedabad","pachmadhi","jhansi"]}
dic2=pd.Series(dict1)
print(dic2)

name            [shrey, rohit, shubham, vivek]
marks                          [100, 23, 1, 2]
city     [unnao, ahmedabad, pachmadhi, jhansi]
dtype: object

In [4]:
dict3={
    "name":["shrey","rohit","shubham","vivek"],
    "marks":[100,23,1,2],
    "city":["unnao","ahmedabad","pachmadhi","jhansi"]}
dic4=pd.DataFrame(dict3)
print(dic4)

      name  marks       city
0    shrey    100      unnao
1    rohit     23  ahmedabad
2  shubham      1  pachmadhi
3    vivek      2     jhansi

In [5]:
#we can particularly print a column also by using colummn function in dataframe function and you can also use index function for indexing
dict4={
    "name":["shrey","rohit","shubham","vivek"],
    "marks":[100,23,1,2],
    "city":["unnao","ahmedabad","pachmadhi","jhansi"]}
dic5=pd.DataFrame(dict4,columns=["name"],index=["a","b","c","d"])
print(dic5)

      name
a    shrey
b    rohit
c  shubham
d    vivek

In [6]:
print(dict4["name"][1])

rohit

In [7]:
#we can make a new column by doing any arithmatic operation between two columns of the same table
var1= pd.DataFrame({"A":[10,20,30,40],"B":[15,16,17,18]})
var1["C"]=var1["A"]+var1["B"]
var1

    A   B   C
0  10  15  25
1  20  16  36
2  30  17  47
3  40  18  58

In [8]:
#we can check in a column that by giving my conditon in that column is satisfy or not if satisfy then true otherwiise false
var1["python"]=var1["A"]>=20
var1

    A   B   C  python
0  10  15  25   False
1  20  16  36    True
2  30  17  47    True
3  40  18  58    True

In [9]:
#wee can insert a column between two columns by using insert funuction
var1.insert(1,"shrey",var1["A"])
var1

    A  shrey   B   C  python
0  10     10  15  25   False
1  20     20  16  36    True
2  30     30  17  47    True
3  40     40  18  58    True

In [10]:
#you can also insert new column by slicing

In [11]:
#you can delete the column by pop function and also by del function pop give you instant data you have deleted and del function only delete the data not show deleted part instantly

var1.pop("B")

0    15
1    16
2    17
3    18
Name: B, dtype: int64

In [12]:
del var1["C"]

In [13]:
var1

    A  shrey  python
0  10     10   False
1  20     20    True
2  30     30    True
3  40     40    True

In [14]:
#this is the method to open the dataset in excel o rin csv file
var1.to_csv("first_csv_file.csv",index=False)

In [15]:
#you can also load the file or open the file here by using the function pd.read_csv(file_path)
csv_1=pd.read_csv("first_read_file.csv")
csv_1

    1   er
0   2   fd
1   3   df
2   4  dfd
3   5   df
4   6    d
5   7    d
6  88   fd

In [16]:
#you can read the particular columns also by using usecols functon
csv_1=pd.read_csv("first_read_file.csv",usecols=["1"])
csv_1

    1
0   2
1   3
2   4
3   5
4   6
5   7
6  88

In [17]:
#you can also skip the rows at the time of read the data
csv_1=pd.read_csv("first_read_file.csv",skiprows=[0])
csv_1

    2   fd
0   3   df
1   4  dfd
2   5   df
3   6    d
4   7    d
5  88   fd

In [18]:
#ypu can make any row as a heading by using header function
csv_1=pd.read_csv("first_read_file.csv",header=2)
csv_1

    3   df
0   4  dfd
1   5   df
2   6    d
3   7    d
4  88   fd

In [19]:
#you can also change the heading by using names function
csv_1=pd.read_csv("first_read_file.csv",names=["col1","col2"])
csv_1

   col1 col2
0     1   er
1     2   fd
2     3   df
3     4  dfd
4     5   df
5     6    d
6     7    d
7    88   fd

In [20]:
#you can also change the data type of the column by using dictionary using function dtype

csv_1=pd.read_csv("first_read_file.csv",dtype={"1":"float"})
csv_1

      1   er
0   2.0   fd
1   3.0   df
2   4.0  dfd
3   5.0   df
4   6.0    d
5   7.0    d
6  88.0   fd

In [21]:
#to know all the columns of the table
csv_1.columns

Index(['1', 'er'], dtype='object')

In [22]:
#to dexcribe
csv_1.describe()

               1
count   7.000000
mean   16.428571
std    31.606208
min     2.000000
25%     3.500000
50%     5.000000
75%     6.500000
max    88.000000

In [23]:
#to get the data from the upper head function is used and from below tail function is used
csv_1.head()

     1   er
0  2.0   fd
1  3.0   df
2  4.0  dfd
3  5.0   df
4  6.0    d

In [24]:
csv_1.tail(2)

      1  er
5   7.0   d
6  88.0  fd

In [25]:
#actually you can get any data from a table by slicing
csv_1[2:5]

     1   er
2  4.0  dfd
3  5.0   df
4  6.0    d

In [26]:
#you can conert this whole table in numpy array
csv_1.to_numpy()

array([[2.0, 'fd'],
       [3.0, 'df'],
       [4.0, 'dfd'],
       [5.0, 'df'],
       [6.0, 'd'],
       [7.0, 'd'],
       [88.0, 'fd']], dtype=object)

In [27]:
#you can read the data in upside down format also using sort_index() function
csv_1.sort_index(axis=0,ascending=False)

      1   er
6  88.0   fd
5   7.0    d
4   6.0    d
3   5.0   df
2   4.0  dfd
1   3.0   df
0   2.0   fd

In [28]:
#we can change the data of the table also by using the loc function
csv_1.loc[0,"er"]="python"
csv_1

      1      er
0   2.0  python
1   3.0      df
2   4.0     dfd
3   5.0      df
4   6.0       d
5   7.0       d
6  88.0      fd

In [29]:
#loc function also used to show the data of userr desired
csv_1.loc[[2,3],["er"]]
csv_1.loc[:,["er"]]

       er
0  python
1      df
2     dfd
3      df
4       d
5       d
6      fd

In [30]:
#if you want to access the item of the table using matrix format then you can get it by using  iloc function
csv_1.iloc[0,0]

2.0

In [31]:
#if your data is missing from the table in excel you can remove that row or column from the table by using the dropna function
csv_1.dropna(axis=1)

      1      er
0   2.0  python
1   3.0      df
2   4.0     dfd
3   5.0      df
4   6.0       d
5   7.0       d
6  88.0      fd

In [32]:
#if you want to drop the row which contain all none but do not want to delete the row which contain one or two nonee
csv_1.dropna(how="all")

      1      er
0   2.0  python
1   3.0      df
2   4.0     dfd
3   5.0      df
4   6.0       d
5   7.0       d
6  88.0      fd

In [33]:
#if you want to delete the row which contain null for a particular column then you can do it by subset function in dropna function
csv_1.dropna(subset=["er"])

      1      er
0   2.0  python
1   3.0      df
2   4.0     dfd
3   5.0      df
4   6.0       d
5   7.0       d
6  88.0      fd

In [34]:
#if you want to delete all records having any null value then use inplace function in dropna function
#csv_1.dropna(inplace=True)

In [35]:
#it delete the records having one null value
# csv_1.dropna(thresh=1)

In [36]:
#if you want to fillthe data in place of nan
csv_1.fillna("data")

      1      er
0   2.0  python
1   3.0      df
2   4.0     dfd
3   5.0      df
4   6.0       d
5   7.0       d
6  88.0      fd

In [37]:
#actually you can also fill the particular value of nan of a particular column then you can do it by using dictionary

In [38]:
#it fill the value in the null row of just upper row data
csv_1.fillna(method="ffill")

C:\Users\shrey\AppData\Local\Temp\ipykernel_3156\3775788368.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  csv_1.fillna(method="ffill")

      1      er
0   2.0  python
1   3.0      df
2   4.0     dfd
3   5.0      df
4   6.0       d
5   7.0       d
6  88.0      fd

In [39]:
#it fill the value in the null row of just below row data and you also can give the axis

csv_1.fillna(method="bfill")

C:\Users\shrey\AppData\Local\Temp\ipykernel_3156\1457547213.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  csv_1.fillna(method="bfill")

      1      er
0   2.0  python
1   3.0      df
2   4.0     dfd
3   5.0      df
4   6.0       d
5   7.0       d
6  88.0      fd

In [40]:
#initially vo 2 nan me python fill kr dega
csv_1.fillna("python",limit=2)

      1      er
0   2.0  python
1   3.0      df
2   4.0     dfd
3   5.0      df
4   6.0       d
5   7.0       d
6  88.0      fd